app/controllers/login_controller.rb

	def check_email_exists
		email = params[:email]
		user = User.find_by_email(email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'ddarkeau@gmail.com' LIMIT 1

	def create
		if params[:password] == params[:rep_pass]
			user = User.create(user_params)
---
INSERT INTO `users` (`created_at`, `email`, `password`, `salt`, `updated_at`) VALUES ('2013-12-13 00:07:12', 'jacqueline@gmail.com', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '708a54a0-45b8-0131-eebf-3c07542e5dcb', '2013-12-13 00:07:12')

	def update
		user = User.find_by_email(params[:email])
		puts "User:"
		puts user.as_json
		puts "Params:"
		puts params.as_json
		unhashed = params[:user_password]
		user.password = unhashed # will be hashed after save

		unless user.save
			puts "Update save failed"
		end
		new_user = User.authenticate(user.email, unhashed)
		if new_user
			session[:user_id] = new_user.email
			destroyed = TempPassword.destroy_all(:email => new_user.email)
			puts destroyed.length.to_s + " temp passwords destroyed"
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jrcanty@gmail.com' LIMIT 1
UPDATE "users" SET "password" = $1, "salt" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["password", "37d9ae6473a03e103b300e7aab225da6747049b2"], ["salt", "1168b8f0-83c6-0131-fcb8-3c07542e5dcb"], ["updated_at", Sat, 01 Mar 2014 23:20:57 UTC +00:00]]
DELETE FROM "temp_passwords" WHERE "temp_passwords"."id" = $1  [["id", 1]]
SELECT `temp_passwords`.* FROM `temp_passwords` WHERE `temp_passwords`.`email` = 'jrcanty@gmail.com'

	def forgot_post
		user = User.find_by_email(params[:forgot_user_email])
		if user
			tmp = TempPassword.create(:email => params[:forgot_user_email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jrcanty@gmail.com' LIMIT 1
INSERT INTO `temp_passwords` (`created_at`, `email`, `hashed_uuid`, `updated_at`, `uuid`) VALUES ('2013-12-20 19:21:25', 'jrcanty@gmail.com', '3515e6394aa54a260a76ae5c5a19790896a89ede', '2013-12-20 19:21:25', 'd7d3b9a0-4bd9-0131-c8f1-3c07542e5dcb')