app/controllers/profile_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jrcanty@gmail.com' LIMIT 1
SELECT `categories`.* FROM `categories`
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = $1  [["user_id", 1]]
---
	def index
		@user = User.find_by_email(session[:user_id])
		unless @user
			redirect_to(:controller => 'login', :action=> 'signup')
      return
		end
    @categories = Category.all
    gon.entries = @user.entry_array
    gon.new_user = !(@user.grad_date && @user.first_name && @user.last_name)

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jrcanty@gmail.com' LIMIT 1
UPDATE `users` SET `first_name` = 'Ryan', `last_name` = 'Canty', `grad_date` = '08/25/2014', `password` = '353e8061f2befecb6818ba0c034c632fb0bcae1b', `updated_at` = '2014-06-16 23:41:21' WHERE `users`.`id` = 1
---
  def user_update
    @user = User.find_by_email(session[:user_id])
    if @user
      @user.first_name = params[:first_name]
      @user.last_name = params[:last_name]
      @user.grad_date = params[:grad_date]
      @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jrcanty@gmail.com' LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
INSERT INTO `user_hours` (`created_at`, `recorded_hours`, `subcategory_id`, `updated_at`) VALUES ('2014-06-18 01:51:31', 0.5, 1, '2014-06-18 01:51:31')
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`id` = 1 LIMIT 1
---
  def add_entry
    categories = params[:categories] || []
    subcategories = params[:subcategories] || []

    @user = User.find_by_email(session[:user_id])
    hours_array = []
    categories.each do |c|
      category = Category.find c[1]['id'].to_i
      hours = c[1]['val'].to_f
      uh = UserHour.new
      uh.category = category
      uh.recorded_hours = hours
      if uh.save
	     	hours_array.push(uh)
      else
        puts uh.errors
      end
    end


    subcategories.each do |sc|
      subcategory = Subcategory.find sc[1]['id'].to_i