app/views/profile/index.html.haml

  .col-sm-4.col-sm-offset-2.col-sm-pull-4
    /= select("entry", "id", @user.entries.collect {|e| [ e.description, e.id ] },{}, {size: '20'})
    .entry-box
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = $1  [["user_id", 1]]