app/views/profile/index.html.haml

              %td
                = text_field_tag "#{c.id}", '', placeholder: 'Hours', class: 'entry-category form-control' if c.subcategories.count == 0 || c.id == 2
---
SELECT COUNT(*) FROM `subcategories` WHERE `subcategories`.`category_id` = 1
SELECT `categories`.* FROM `categories`
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`category_id` = 1

        %button.btn.btn-default{"data-dismiss" => "modal", type: "button"} Close
        %button.btn.btn-primary.create-entry{type: "button"} Create Entry
---
INSERT INTO "entries" ("created_at", "description", "password", "updated_at", "user_id", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"